/********************************************************************
 *文件名称:main.c
 *文件日期:2020/07/12
 *作    者:樊忠祥
 *文件功能:程序框架的搭建
 ********************************************************************
 *修改日期:2020/07/19
 *作    者:樊忠祥
 *修改说明:增加了文件操作的一些函数以及头文件包含
 ********************************************************************/

#include <stdio.h>
#include "pubfile.h"

int main()
{
	int ret  = 0;
	int fd = 0;

	printf("---------------------------系统服务开始启动--------------------------------\n");
	
	ret  = myopen("./cpro.ini",O_RDONLY,fd);
	if( ret < 0)
	{
		printf("打开文件失败\n");
	}
	else
	{
		printf("打开文件成功\n");
	}
	return 0;
}
